Repository: S-Shimotori/SampleViewer
Catalog: SampleViewer/Localizable.xcstrings
Source language: en
Languages: ja

# button.seemore
source: See more
ja: もっと見る

# font-weight.black
source: Black
ja: ブラック

# font-weight.bold
source: Bold
ja: ボールド

# font-weight.heavy
source: Heavy
ja: ヘビー

# font-weight.light
source: Light
ja: ライト

# font-weight.medium
source: Medium
ja: ミディアム

# font-weight.regular
source: Regular
ja: レギュラー

# font-weight.semibold
source: Semibold
ja: セミボールド

# font-weight.thin
source: Thin
ja: シン

# font-weight.ultralight
source: Ultralight
ja: ウルトラライト

# hig.accessibility.controls.configuration.description
source: You can use the visually prominent filled style for the button that performs the most likely action in a view, using less prominent styles — such as gray or plain — for buttons that perform less important actions.
ja: ビューで頻繁に実行されるアクションのボタンに塗りつぶしスタイルを適用して目立たせ、重要性の低いアクションのボタンには目立たないグレイや標準のスタイルを適用できます。

# hig.accessibility.controls.configuration.title
source: Relative Importance of Buttons
ja: ボタンの相対的重要性

# hig.accessibility.controls.size.button.caption
source: Last tapped
ja: 最後にタップした日時

# hig.accessibility.controls.size.description
source: On touchscreen devices, a hit target needs to measure at least 44x44 pt.
ja: タッチスクリーンデバイスでは、ヒットターゲットの大きさが44x44ポイント以上である必要があります。

# hig.accessibility.controls.size.title
source: Size of Hit Target
ja: ヒットターゲットの大きさ

# hig.accessibility.gestures.alternative.description
source: Include an option for people who may not be able to perform a specific gesture.
ja: 特定のジェスチャができないユーザ向けのオプションを含めます。

# hig.accessibility.gestures.alternative.title
source: Alternative Ways to Perform Gesture-based Actions
ja: ジェスチャベースのアクションを実行するための代替手段

# hig.accessibility.grouped.artichokes.accessibility
source: A large container holding many green artichokes.
ja: たくさんの緑のアーティチョークが入っている大きな容器。

# hig.accessibility.grouped.artichokes.description
source: Artichokes come from a variety of a species of thistle.
ja: アーティチョークはさまざまなアザミから取れます。

# hig.accessibility.grouped.description
source: Examine your app for places where relationships among elements are visual only, and describe these relationships to VoiceOver.
ja: 要素間の関係が視覚のみで提示されている箇所がないかアプリを検査し、そうした箇所があれば、その関係性の説明をVoiceOverに提供してください。

# hig.accessibility.grouped.mangoes.accessibility
source: A large container holding a variety of mangoes.
ja: いろいろなマンゴーが入っている大きな容器。

# hig.accessibility.grouped.mangoes.description
source: Mangoes come from trees that belong to the genus Mangifera.
ja: マンゴーはマンゴー属の木から取れます。

# hig.accessibility.grouped.title
source: Improve the VoiceOver Experience
ja: VoiceOverの操作性を改善

# hig.accessibility.text.to
source: To
ja: 宛先

# hig.charting-data.descriptive.description
source: You can also display brief descriptive text that serves as a headline or summary for a chart, helping people grasp essential information at a glance.
ja: ユーザが不可欠な情報を一目で把握できるように、グラフの見出しや概要の役割を果たす簡潔な説明文を追加することもできます。

# hig.charting-data.descriptive.forecast.description
source: Clear conditions expected around 18:00. Wind gusts up to 14 m/s are making the temperature feel like 4°.
ja: 18:00頃に快晴の予想です。最大風速14m/sの風の影響で、体感温度は4°Cです。

# hig.charting-data.descriptive.now.description
source: Now
ja: 現在

# hig.charting-data.descriptive.sunrise.description
source: Sunrise
ja: 日の出

# hig.charting-data.descriptive.sunset.description
source: Sunset
ja: 日の入

# hig.charting-data.descriptive.title
source: Descriptive text
ja: 説明となる文字列

# hig.dark-mode.colors.dark.title
source: System colors in the dark appearance
ja: ダークな外観でのシステムカラー

# hig.dark-mode.colors.description
source: Semantic colors (like labelColor and controlColor in macOS or separator in iOS and iPadOS) automatically adapt to the current appearance.
ja: セマンティックカラー（macOSのlabelColorやcontrolColor、iOSとiPadOSのseparatorなど）は、自動的に現在の外観に適応します。

# hig.dark-mode.colors.light.title
source: System colors in the light appearance
ja: ライトな外観でのシステムカラー

# hig.dark-mode.colors.title
source: Colors
ja: カラー

# hig.dark-mode.labels.dark.title
source: Labels in the dark appearance
ja: ダークな外観でのラベル

# hig.dark-mode.labels.description
source: The primary, secondary, tertiary, and quaternary label colors adapt automatically to the light and dark appearances.
ja: 第1、第2、第3、第4のラベルカラーは、ライトとダークの外観に自動的に適応します。

# hig.dark-mode.labels.light.title
source: Labels in the light appearance
ja: ライトな外観でのラベル

# hig.dark-mode.labels.title
source: Labels
ja: ラベル

# hig.materials.ios.description
source: The following materials are available:
ja: 以下のマテリアルを使用できます:

# hig.materials.ios.title
source: Materials
ja: マテリアル

# hig.materials.ios.vibrancy.defaultLabel.description
source: Default label on regular material
ja: regularマテリアルでのデフォルトラベル

# hig.materials.ios.vibrancy.label.description
source: Except for quaternary, you can use the following vibrancy values for labels on any material. In general, avoid using quaternary on top of the thin and ultraThin materials, because the contrast is too low.
ja: 4段階目のquaternaryLabelを除き、あらゆるマテリアルのラベルには次のバイブランス値を使用できます。一般的に、thinおよびultraThinの上では、コントラストが低すぎるため、4段階目の使用は避けてください。

# hig.materials.ios.vibrancy.quaternaryLabel.description
source: Quaternary label on regular material
ja: regularマテリアルでの第4ラベル

# hig.materials.ios.vibrancy.secondaryLabel.description
source: Secondary label on regular material
ja: regularマテリアルでの第2ラベル

# hig.materials.ios.vibrancy.separator.description
source: Labels and fills both have several levels of vibrancy; separators have one level.
ja: ラベルと塗りつぶしにはどちらも複数のレベルのバイブランスがありますが、区切りには1つのレベルしかありません。

# hig.materials.ios.vibrancy.tertiaryLabel.description
source: Tertiary label on regular material
ja: regularマテリアルでの第3ラベル

# hig.materials.ios.vibrancy.title
source: Vibrancy
ja: バイブランス

# hig.right-to-left.font-size.description
source: In buttons, labels, and titles, Arabic or Hebrew text can appear too small when next to uppercased Latin text, because Arabic and Hebrew don’t include uppercase letters. To visually balance Arabic or Hebrew text with Latin text that uses all capitals, it often works well to increase the RTL font size by about 2 points.
ja: ボタン、ラベル、タイトルでは、アラビア文字またはヘブライ文字のテキストを大文字ラテン文字の横に配置すると、小さすぎるように見えることがあります。アラビア文字とヘブライ文字には大文字が含まれないからです。アラビア文字またはヘブライ文字のテキストとすべて大文字のラテン文字のテキストとの視覚的なバランスを取るには、多くの場合RTLのフォントサイズを2ポイントほど大きくするとうまくいきます。

# hig.right-to-left.font-size.title
source: RTL font size
ja: RTLのフォントサイズ

# hig.right-to-left.interface.backslash.title
source: Interface icons that include a backslash
ja: バックスラッシュを含むシンボル

# hig.right-to-left.interface.component.title
source: Flip a component (or its position)
ja: コンポーネント（またはその位置）を反転

# hig.right-to-left.interface.description
source: When you use SF Symbols to supply interface icons for your app, you get variants for the RTL context and localized symbols for Arabic and Hebrew, among other languages.
ja: SF Symbolsを使ってアプリのインターフェイスアイコンを利用する場合は、RTLコンテキスト用のバリエーションとアラビア語やヘブライ語などの言語用にローカライズされたシンボルを利用できます。

# hig.right-to-left.interface.directional.title
source: Directional interface icons
ja: 方向のあるシンボル

# hig.right-to-left.interface.localized.title
source: Interface icons that display text
ja: テキストを含むインターフェイスアイコン

# hig.right-to-left.interface.motion.title
source: Interface icons that show forward or backward motion
ja: 前方または後方への動きを示すインターフェイスアイコン

# hig.right-to-left.interface.text.title
source: Interface icons that represent text or reading direction
ja: テキストまたは読む方向を表すインターフェイスアイコン

# hig.right-to-left.interface.title
source: Interface icons
ja: インターフェイスアイコン

# hig.right-to-left.interface.tool.title
source: Interface icons that depict a tool
ja: 道具を表すシンボル

# hig.right-to-left.interface.variant.ltr.description
source: LTR variant(s)
ja: LTRバリエーション

# hig.right-to-left.interface.variant.rtl.description
source: RTL variant(s)
ja: RTLバリエーション

# hig.right-to-left.number-system.description
source: The use of Western and Eastern Arabic numerals varies among countries and regions and even among areas within the same country or region.
ja: 西アラビア数字とインド数字のどちらが使用されるかは、国や地域によって、さらには同じ国や地域内の場所によって異なります。

# hig.right-to-left.number-system.title
source: Number System
ja: 記数法

# hig.right-to-left.rating.description
source: Controls like progress bars, sliders, and rating controls often include numerals to clarify their meaning. If you use numerals in this way, be sure to reverse the order of the numerals to match the direction of the flipped control. Also reverse a sequence of numerals if you use the sequence to communicate a specific order.
ja: 進行状況バー、スライダ、評価コントロールなどのコントロールには、意味を明瞭にするために数字が含まれることがよくあります。数字をこのように使用する場合は、反転したコントロールの向きに合わせて必ず数字を逆順にしてください。また、数字のシーケンスを使って特定の順序を伝える場合は、シーケンスを逆順にします。

# hig.right-to-left.rating.title
source: Numerals that show progress or a counting direction
ja: 進行状況またはカウントの方向を示す数字

# hig.sf-symbols.animations.appear.description
source: Appear
ja: 表示

# hig.sf-symbols.animations.bounce.description
source: Bounce
ja: バウンス

# hig.sf-symbols.animations.breathe.description
source: Breathe
ja: 呼吸

# hig.sf-symbols.animations.description
source: SF Symbols provides a collection of expressive, configurable animations that enhance your interface and add vitality to your app. Symbol animations help communicate ideas, provide feedback in response to people’s actions, and signal changes in status or ongoing activities.
ja: SF Symbolsには、表現力豊かで自在に設定できるアニメーションのコレクションが用意されています。アニメーションは、インターフェイスの魅力を高め、アプリに活気を与えるのに役立ちます。シンボルのアニメーションは、アイデアを伝えたり、ユーザの操作に応じたフィードバックを返したり、ステータスや進行中のアクティビティの変化を通知したりするのに便利です。

# hig.sf-symbols.animations.disappear.description
source: Disappear
ja: 非表示

# hig.sf-symbols.animations.magic.description
source: Magic Replace
ja: マジック置換

# hig.sf-symbols.animations.pulse.description
source: Pulse
ja: パルス

# hig.sf-symbols.animations.replace.description
source: Replace
ja: 置き換え

# hig.sf-symbols.animations.rotate.description
source: Rotate
ja: 回転

# hig.sf-symbols.animations.scale.description
source: Scale
ja: スケール

# hig.sf-symbols.animations.title
source: Animations
ja: アニメーション

# hig.sf-symbols.animations.toggle.title
source: Toggle to animate
ja: アニメーションのトグルスイッチ

# hig.sf-symbols.animations.variableColor.description
source: Variable color
ja: 可変カラー

# hig.sf-symbols.animations.wiggle.description
source: Wiggle
ja: 揺れ

# hig.sf-symbols.rendering.description
source: SF Symbols provides four rendering modes — monochrome, hierarchical, palette, and multicolor — that give you multiple options when applying color to symbols.
ja: SF Symbolsには、モノクロ、階層、パレット、マルチカラーの4つのレンダリングモードがあります。

# hig.sf-symbols.rendering.hierarchical.description
source: Hierarchical
ja: 階層

# hig.sf-symbols.rendering.monochrome.description
source: Monochrome
ja: モノクロ

# hig.sf-symbols.rendering.multicolor.description
source: Multicolor
ja: マルチカラー

# hig.sf-symbols.rendering.palette.description
source: Palette
ja: パレット

# hig.sf-symbols.rendering.title
source: Rendering modes
ja: レンダリングモード

# hig.sf-symbols.variant.description
source: SF Symbols defines several design variants — such as fill, slash, and enclosed — that can help you communicate precise states and actions while maintaining visual consistency and simplicity in your UI.
ja: SF Symbolsでは、塗りつぶし、スラッシュ、囲みなどの複数のデザインバリアントが定義されています。これによって、UI内で視覚的な一貫性とシンプルさを保ちつつ、状態やアクションを正確に伝えることができます。

# hig.sf-symbols.variant.language-specific.description
source: SF Symbols provides many variants for specific languages and writing systems, including Latin, Arabic, Hebrew, Hindi, Thai, Chinese, Japanese, Korean, Cyrillic, Devanagari, and several Indic numeral systems.
ja: SF Symbolsには、ラテン文字、アラビア語、ヘブライ語、ヒンディー語、タイ語、中国語、日本語、韓国語、キリル文字、デーバナーガリー数字や、複数のインド数字など、特定の言語や表記法向けのバリアントが多数用意されています。

# hig.sf-symbols.variant.language-specific.title
source: Language- and script-specific variants
ja: 言語および文字固有のバリアント

# hig.sf-symbols.variant.title
source: Design variants
ja: デザインバリアント

# hig.sf-symbols.weight-and-scale.description
source: SF Symbols provides symbols in a wide range of weights and scales to help you create adaptable designs.
ja: SF Symbolsでは、適応性の高いデザインを作成できるように、さまざまなウェイトとスケールのシンボルが提供されます。

# hig.sf-symbols.weight-and-scale.scale.title
source: Scales
ja: スケール

# hig.sf-symbols.weight-and-scale.title
source: Weights and scales
ja: ウェイトとスケール

# hig.sf-symbols.weight-and-scale.weight.title
source: Weights
ja: ウェイト

# hig.typography.font-weight.description
source: In general, avoid light font weights. For example, if you’re using system-provided fonts, prefer Regular, Medium, Semibold, or Bold font weights, and avoid Ultralight, Thin, and Light font weights, which can be difficult to see, especially when text is small.
ja: 通常はフォントのライトウェイトを避ける。例えば、システムで提供されるフォントを使用する場合は、レギュラー、ミディアム、セミボールド、またはボールドのフォントウェイトを優先的に使用し、特にテキストが小さい場合に読みづらくなりがちなウルトラライト、シン、ライトのフォントウェイトを避けてください。

# hig.typography.font-weight.title
source: Font weights
ja: フォントウェイト

# hig.typography.leading.description
source: You can also use symbolic traits to adjust leading if you need to improve readability or conserve space. For example, when you display text in wide columns or long passages, more space between lines (loose leading) can make it easier for people to keep their place while moving from one line to the next. Conversely, if you need to display multiple lines of text in an area where height is constrained — for example, in a list row — decreasing the space between lines (tight leading) can help the text fit well. If you need to display three or more lines of text, avoid tight leading even in areas where height is limited.
ja: シンボル特性を使って、読みやすさを向上させたりスペースを節約したりする必要がある場合にレディングを調整することもできます。例えば、幅の広い列または長い一節にテキストを表示する場合、行の間隔を広げると（ゆるいレディング）、ユーザがある行から次の行に進むときに自分がどこを読んでいるかが分かりやすくなります。逆に、高さに制限のある領域（リストの行など）に複数のテキスト行を表示する必要がある場合は、行の間隔を狭くすると（きついレディング）、テキストをうまく収めることができます。3行以上のテキストを表示する必要がある場合は、高さに制限がある領域であってもレディングをきつくしないでください。

# hig.typography.leading.title
source: Leading
ja: レディング

# hig.typography.size.description
source: Use font sizes that most people can read easily. For example, aim to use the minimum font size of 11 pt in iOS and iPadOS, 10 pt in macOS, 23 pt in tvOS, and 12 pt in visionOS and watchOS. It’s important to recognize that differences in device displays, including pixel density and brightness, in addition to other factors — such as ambient lighting, the reader’s proximity to the text, their visual acuity, and whether they’re in motion — can all impact legibility.
ja: ほとんどの人が簡単に読めるフォントサイズを使用する。例えば、最小フォントサイズとしてiOSとiPadOSでは11 ptを、macOSでは10 ptを、tvOSでは23 ptを、visionOSとwatchOSでは12 ptを使用してください。ピクセル密度や輝度といったデバイスごとのディスプレイの違いに加えて、その他の要因（周囲の照明条件、読み手とテキストの近さ、読み手の視力、読み手が動いているかどうかなど）がすべて読みやすさに影響すると認識することが大切です。

# hig.typography.size.title
source: Font size
ja: フォントサイズ

# leading.loose
source: Loose leading
ja: ゆるいレディング

# leading.standard
source: Standard
ja: 標準

# leading.tight
source: Tight leading
ja: きついレディング

# locale.ar_AE
source: Arabic, United Arab Emirates
ja: アラビア語、アラブ首長国連邦

# locale.ar_SA
source: Arabic, Saudi Arabia
ja: アラビア語、サウジアラビア

# locale.en_US
source: English, U.S.A.
ja: 英語、米国

# locale.he_IL
source: Hebrew, Israel
ja: ヘブライ語、イスラエル

# locale.hi_IN
source: Hindi, India
ja: ヒンズー語、インド

# locale.ja_JP
source: Japanese, Japan
ja: 日本語、日本

# locale.ko_KR
source: Korean, Korea
ja: 韓国語、韓国

# locale.th_TH
source: Thai, Thailand
ja: タイ語、タイ

# locale.zh_CN
source: Simplified Chinese, China
ja: 簡体字中国語、中国

# sample.description
source: Description
ja: 説明文

# sample.detail
source: Detail
ja: 詳細

# sample.label
source: Label
ja: ラベル

# sample.name.1
source: Chad Potter
ja: 平井康正

# sample.name.2
source: Danny Rico
ja: 河原敏彦

# sample.navigation.title
source: Navigation Title
ja: ナビゲーションタイトル

# sample.section.title
source: Section Title
ja: セクションタイトル

# sample.subtitle
source: Subtitle
ja: サブタイトル

# sample.title
source: Title
ja: タイトル
